Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughAvailSlotsOnDataPanel Property
 You can't connect to data panel [Panel Name] because there isn't enough space \nYou can increase the number of circuits to be greater than [Number].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughAvailSlotsOnDataPanel { get; }
Public Shared ReadOnly Property NotEnoughAvailSlotsOnDataPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughAvailSlotsOnDataPanel {
	FailureDefinitionId^ get ();
}
static member NotEnoughAvailSlotsOnDataPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace